fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИРеализаций</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ПериодПриИзменении(Элемент)
	ЗаполнитьДоговоры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите период!");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьРеализацииНаСервере();
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    ОтобразитьИзменениеДанных(Объект.СписокДоговоровИРеализаций, ВидИзмененияДанных.Изменение);
    
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьРеализацииНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "Документы.РеализацияТоваровУслуг.СоздатьРеализации", 
      Объект.ВКМ_Период);
      
КонецФункции
  
//Обработка результата длительной операции:
&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
     Если Результат = Неопределено Тогда
     	Возврат;
     КонецЕсли;
     Текст = Результат.Сообщения[0].Текст;
     Если ЗначениеЗаполнено(Текст) Тогда
     	Текст = "Документ записан, но не проведен." + Текст;
     КонецЕсли;
     ОбщегоНазначенияКлиент.СообщитьПользователю("Работа обработки завершена." + Текст);
    
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДоговоры()   
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК СсылкаДоговор,
	|	РеализацияТоваровУслуг.Ссылка КАК СсылкаРеализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНАЧАЛА И &ДатаОКОНЧАНИЯ)
	|ГДЕ
	|		ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ"; 
	
	Запрос.УстановитьПараметр("ДатаНАЧАЛА", Объект.ВКМ_Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОКОНЧАНИЯ", Объект.ВКМ_Период.ДатаОкончания);
  
    РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
    
    Объект.СписокДоговоровИРеализаций.Очистить();
    
    Пока РезультатЗапроса.Следующий() Цикл
        НоваяСтрока = Объект.СписокДоговоровИРеализаций.Добавить(); 
        НоваяСтрока.ВКМ_Договор = РезультатЗапроса.СсылкаДоговор; 
        НоваяСтрока.ВКМ_Реализация = РезультатЗапроса.СсылкаРеализация;
    КонецЦикла;   

КонецПроцедуры
#КонецОбласти
